
  #### plan-nodes-20251129T210042.txt 📖: `success`
  <details><summary>Show Contents</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.k8s-test.google_iam_oauth_client_credential.argocd will be created
  + resource "google_iam_oauth_client_credential" "argocd" {
      + client_secret              = (sensitive value)
      + id                         = (known after apply)
      + location                   = "global"
      + name                       = (known after apply)
      + oauth_client_credential_id = "tiles-test-argocd"
      + oauthclient                = "tiles-test-argocd-oauth"
      + project                    = "symm-custodes"
    }

  # module.k8s-test.onepassword_item.argocd_google_oauth will be created
  + resource "onepassword_item" "argocd_google_oauth" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "argocd-google-oauth"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "OAUTH_CLIENT_ID"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "OAUTH_CLIENT_SECRET"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "cluster_name"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "argocd_url"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

  ```

  </details>
  
  